before/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Nickelback"], ["created_at", "2015-12-08 02:02:08.517092"], ["updated_at", "2015-12-08 02:02:08.517092"]]
---
  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      format.html do
        if @artist.save

UPDATE "artists" SET "name" = $1, "bio" = $2, "updated_at" = $3 WHERE "artists"."id" = $4  [["name", "Creed"], ["bio", "We're all like in my own prison, man"], ["updated_at", "2015-12-08 02:21:27.269362"], ["id", 980190968]]
---
  def update
    @artist = get_artist

    respond_to do |format|
      format.html do
        if @artist.update_attributes(artist_params)

DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 980190968]]
---
  def destroy
    @artist = get_artist

    respond_to do |format|
      format.html do
        @artist.destroy